Project/Toir.Adaptation/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗавершитьРемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f78c6d7a-513d-4172-acd6-67cd539553be">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6ebc082-5b34-4dc9-989e-5ceca388a781">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="93edf17a-e6e1-43b7-b637-bb7683198138">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c026f7f3-9001-48e8-ae43-b6311afc572a">
      <name>Родитель_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="13c5222c-e72c-4deb-976b-ea5e71c2a76c">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5b155dad-268f-40a5-9cda-adf38b849861">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="292545f4-3656-4274-98e7-6524e7005040">
      <name>НоваяОперация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1e00ed1-d007-48a1-a97c-9c09cb1af366">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bce66135-2c2d-4b02-9b24-1b4b257fc415">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6e222db4-48e2-41e6-b0db-be541d07402b">
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="783b72be-3d92-47e1-83c1-f83e5d116bfb">
      <name>гкс_Давальческие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="305c47b2-824e-4796-a135-d4962b2f23d3">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="fb2fda01-f8af-4657-9434-8cc1e4174283">
    <name>ДатаНачалаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="fdadcdac-c84a-4c5e-9f9d-425c9ce8d7b8">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущееСостояниеОР/торо_ТекущееСостояниеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущееСостояниеОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидЭксплуатации</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_АктОВыполненииЭтапаРабот/ObjectModule.bsl
#Область ОбработчикиСобытий

&ИзменениеИКонтроль("ПроверитьЗаполнениеТабличнойЧастиТрудовыеЗатраты")
Процедура Расш_гкс_ПроверитьЗаполнениеТабличнойЧастиТрудовыеЗатраты(Отказ)

	ИмяТабличнойЧасти = "ТрудовыеЗатраты";

	#Вставка
	ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти.ТрудовыеЗатраты.Представление();

	МетаданныеРеквизиты = ЭтотОбъект.Метаданные().ТабличныеЧасти.ТрудовыеЗатраты.Реквизиты;
	Для Каждого СтрокаРемонт Из РемонтыОборудования Цикл
		Если ИсполнителиПоРемонтам.Количество() И ТипЗнч(ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
			ИмяПоля = "Квалификация";
		Иначе
			// гкс+ [Релиз16] Деснол
			Продолжить;
			// гкс- [Релиз16]
			ИмяПоля = "Сотрудник";
		КонецЕсли;
		Для Каждого СтрокаТЗ Из ТрудовыеЗатраты Цикл
			Если СтрокаТЗ.РемонтыОборудования_ID = СтрокаРемонт.ID Тогда 
				Если ЗначениеЗаполнено(СтрокаТЗ[ИмяПоля]) = Ложь Тогда 
					СтрокаНачалаСообщенияОбОшибке = 
		НСтр("es='En la línea el número %1 partes tabulares ""%2"": ';
		|ru='В строке номер %1 табличной части ""%2"": ';en='In line number% 1 of table part ""% 2"": '");
					СтрокаНачалаСообщенияОбОшибке = СтрШаблон(СтрокаНачалаСообщенияОбОшибке,СокрЛП(СтрокаТЗ.НомерСтроки),ПредставлениеТабличнойЧасти);
					
					ПредставлениеРеквизита = МетаданныеРеквизиты[ИмяПоля].Представление();
					СтрокаСообщения = НСтр("es='""%1""!';ru='Не заполнено значение реквизита ""%1""!';en='Requisite value ""%1"" is not filled!'");
					СтрокаСообщения = СтрШаблон(СтрокаСообщения,СокрЛП(ПредставлениеРеквизита));

					ОбщегоНазначения.СообщитьПользователю(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения,,,, Отказ);
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат;
	Если ИсполнителиПоРемонтам.Количество() И ТипЗнч(ИсполнителиПоРемонтам[0].Исполнитель) = Тип("СправочникСсылка.Контрагенты") Тогда 
		СтруктураОбязательныхПолей = Новый Структура("Квалификация");
	Иначе
	#КонецВставки
	СтруктураОбязательныхПолей = Новый Структура("Сотрудник");
	Если Константы.торо_ЗапретитьПроведениеАктовСИсполнителямиБезКвалификаций.Получить() Тогда
		СтруктураОбязательныхПолей.Вставить("Квалификация");
	КонецЕсли;
	#Вставка
	КонецЕсли;
	#КонецВставки
	торо_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, "");

КонецПроцедуры

// гкс+ [Релиз 1] Куст 16.12.2020
&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если Не Отказ И Проведен Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ Различные
		               |	торо_ВыявленныеДефектыСрезПоследних.Регистратор КАК Регистратор,
					   |	торо_ВыявленныеДефектыСрезПоследних.ID КАК ИД
		               |ИЗ
		               |	РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних(
		               |			,
		               |			ID В
		               |				(ВЫБРАТЬ Различные
		               |					ТЧ.ID
		               |				ИЗ
		               |					Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ТЧ
					   |	где ТЧ.Ссылка = &Ссылка)) КАК торо_ВыявленныеДефектыСрезПоследних
		               |ГДЕ
		               |	торо_ВыявленныеДефектыСрезПоследних.Регистратор.гкс_Влияние В 
					   | (Значение(Перечисление.гкс_Влияние.ЭкономическиеПотери), Значение(Перечисление.гкс_Влияние.БезЭкономическихПотерь))";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			МассивИД = Новый Массив();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивИД.Добавить(Выборка.ИД);
			КонецЦикла;
			ОбновитьСостояниеОР(МассивИД);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 16.12.2020

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 16.12.2020
Процедура ОбновитьСостояниеОР(МассивИД)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
					|	ТЧ.ОбъектРемонта КАК ОР,
					|	ТЧ.ID КАК ИД_Ремонта,
					|	ТЧ.ДатаОкончания КАК ДатаОкончания
					|ПОМЕСТИТЬ ВсеОР
					|ИЗ
					|	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК ТЧ
					|ГДЕ
					|	ТЧ.Ссылка = &Акт И
					|	ТЧ.ID В(&МассивИД)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВсеОР.ИД_Ремонта КАК ИД_Ремонта,
					|	МАКСИМУМ(Рег.ОбъектРемонта) КАК ФМ
					|ПОМЕСТИТЬ ФМДляРемонта
					|ИЗ
					|	ВсеОР КАК ВсеОР
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты.СрезПоследних КАК Рег
					|		ПО ВсеОР.ИД_Ремонта = Рег.ID
					|
					|СГРУППИРОВАТЬ ПО
					|	ВсеОР.ИД_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Рег.Период) КАК Период, ТЧ.ДатаОкончания КАК ДатаОкончания,
	               |	Рег.ОбъектРемонта КАК ОР, ТЧ.ИД_Ремонта
	               |ПОМЕСТИТЬ ВсеСостояния
	               |ИЗ
	               |	РегистрСведений.торо_ТекущееСостояниеОР КАК Рег
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОР КАК ТЧ
	               |		ПО Рег.ОбъектРемонта = ТЧ.ОР
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Рег.ОбъектРемонта, ТЧ.ДатаОкончания, ТЧ.ИД_Ремонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Рег.ВидЭксплуатации КАК ВидЭксплуатации,
	               |	Рег.Период КАК Период,
				   |	ЕстьNull(ФМДляРемонта.ФМ, Рег.ОбъектРемонта) КАК ФМ,
	               |	Рег.ОбъектРемонта КАК ОР, ВсеСостояния.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	ВсеСостояния КАК ВсеСостояния
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК Рег
	               |		ПО ВсеСостояния.Период = Рег.Период
	               |			И ВсеСостояния.ОР = Рег.ОбъектРемонта
				   |			И Рег.Период <= ВсеСостояния.ДатаОкончания
				   |		Левое соединение ФМДляРемонта КАК ФМДляРемонта
				   |		ПО ФМДляРемонта.ИД_Ремонта = ВсеСостояния.ИД_Ремонта
				   |ГДЕ
	               |	Рег.ВидЭксплуатации.ТипЭксплуатации = Значение(Перечисление.торо_ТипЭксплуатации.Простой)" 
+ " ; " + "
				   |Выбрать
				   |ТЧ.Ссылка КАК Ссылка, ТЧ.Проведен КАК Проведен
				   |ИЗ Документ.торо_СостоянияОбъектовРемонта КАК ТЧ
				   |Где ТЧ.гкс_ПричинаСоздания = 2 И ТЧ.ДокументОснование = &Акт
				   |Упорядочить По ТЧ.Проведен
				   |
				   |
				   |
				   |
				   |
				   |
				   |";
	Запрос.УстановитьПараметр("Акт", Ссылка);
	Запрос.УстановитьПараметр("МассивИД", МассивИД);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДокСост = Неопределено;
	ПервыйПакет = 3;
	ВторойПакет = ПервыйПакет + 1;
	ТекИерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Если Не РезультатЗапроса[ВторойПакет].Пустой() Тогда 
		ВыборкаДок = РезультатЗапроса[ВторойПакет].Выбрать();
		Если ВыборкаДок.Следующий() Тогда 
			ДокСост = ВыборкаДок.Ссылка.ПолучитьОбъект();
		КонецЕсли;
	КонецЕсли;
	Если Не РезультатЗапроса[ПервыйПакет].Пустой() Тогда 
		Если ДокСост = Неопределено Тогда 
			ДокСост = Документы.торо_СостоянияОбъектовРемонта.СоздатьДокумент();
			ДокСост.Дата = ТекущаяДата();
			ДокСост.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Иначе
			Если ДокСост.ПометкаУдаления = Истина Тогда 
				ДокСост.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		ДокСост.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации;
		ДокСост.Организация = Организация;
		ДокСост.Подразделение = Подразделение;
		ДокСост.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.гкс_Эксплуатация;
		ДокСост.гкс_ПричинаСоздания = 2;
		ДокСост.ДокументОснование = Ссылка;
		ДокСост.ОбъектыРемонта.Очистить();
		Выборка = РезультатЗапроса[ПервыйПакет].Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаТабличнойЧасти = ДокСост.ОбъектыРемонта.Добавить();
			НоваяСтрокаТабличнойЧасти.ДатаОкончания = Выборка.ДатаОкончания;
			НоваяСтрокаТабличнойЧасти.ОбъектРемонта = Выборка.ФМ;
			НоваяСтрокаТабличнойЧасти.Иерархия = ТекИерархия;
			НоваяСтрокаТабличнойЧасти.ВидЭксплуатации = Справочники.торо_ВидыЭксплуатации.гкс_Эксплуатация;
			НоваяСтрокаТабличнойЧасти.ИзменятьСостояниеПодчиненныхОР = Истина;
		КонецЦикла;
		ДокСост.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Если Не ДокСост = Неопределено И ДокСост.ПометкаУдаления = Ложь Тогда 
			ДокСост.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 16.12.2020

#КонецОбласти

// гкс+ [разработка 2021] Куст 27.04.2021
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ФОВводНаОснованииПроведенного = Константы.торо_ВводПотребленияНаОснованииПроведенногоАкта.Получить();
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И ФОВводНаОснованииПроведенного Тогда
		ПроверитьНаличиеВведенныхНаОснованииВнутренныхПотреблений(Отказ);
	КонецЕсли; 
	#Вставка
	// Гкс+[TOIR20-591] Зозуля А.В. от 23.06.2025. Добавлено:{
	Если ОбменДанными.Загрузка = Ложь И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если гкс_ИнтеграцияС1СДокументооборот.НетПрикрепленныхФайловДО(Ссылка) Тогда  
			ТекстСообщения = НСтр("es='Para publicar un documento, debe agregar un archivo a la pestaña «La circulación de documentos»';
									  |ru='Для проведения документа необходимо прикрепить файл на вкладку «Документооборот» в документе «Акт о выполнении этапа работ»';
									  |en='To post a document, you need to add a file to the “Document managment” tab'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;			
		КонецЕсли;	
	КонецЕсли;	
	// } Гкс-[TOIR20-591] Зозуля А.В. от 23.06.2025.
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Для Каждого СтрокаРемонтныхРабот Из РемонтныеРаботы Цикл
			СтрокаРемонтныхРабот.Выполнено = Истина;
		КонецЦикла;
		гкс_РаботыВыполнены = Истина;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		гкс_РаботыВыполнены = Ложь;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись Тогда 
		гкс_РаботыВыполнены = Проведен;
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
// гкс- [разработка 2021] Куст 27.04.2021
